#pragma once
#pragma warning(disable : 4800; disable : 4005)

#include "UtilityBox.h"
#include "obse_editor/EditorAPI.h"
#include "obse/GameData.h"
#include "obse/Script.h"
#include "obse/PluginAPI.h"
#include "obse/GameObjects.h"
#include "obse/NiNodes.h"
#include "obse/NiObjects.h"
#include "obse/NiRenderer.h"
#include "Console.h"
#include <D3dx9tex.h>

#include "[Libraries]\INI Manager\INIManager.h"
#include "[Libraries]\INI Manager\INIEditGUI.h"

extern std::fstream					g_DEBUG_LOG;
extern std::string					g_AppPath;
extern std::string					g_INIPath;
extern char							g_Buffer[0x200];

extern OBSEMessagingInterface*		g_msgIntfc;
extern PluginHandle					g_pluginHandle;
extern HINSTANCE					g_DLLInstance;
extern SME::INI::INIManager*		g_INIManager;
extern SME::INI::INIEditGUI*		g_INIEditGUI;

class EditorAllocator
{
	static EditorAllocator*													Singleton;

	struct SEAlloc {
		HWND																RichEditControl;
		HWND																ListBoxControl;
		UInt32																Index;

																			SEAlloc(HWND REC, HWND LBC, UInt32 IDX): 
																			RichEditControl(REC), ListBoxControl(LBC), Index(IDX) {};
	};

	typedef std::map<HWND, SEAlloc*>										AlMap;
	AlMap																	AllocationMap;
	UInt32																	NextIndex;
	UInt32																	LastContactedEditor;
public:
	static EditorAllocator*													GetSingleton(void);
	UInt32																	TrackNewEditor(HWND EditorDialog);
	void																	DeleteTrackedEditor(UInt32 TrackedEditorIndex);
	void																	DeleteAllTrackedEditors(void);
	void																	DestroyVanillaDialogs(void);

	HWND																	GetTrackedREC(HWND TrackedEditorDialog);
	HWND																	GetTrackedLBC(HWND TrackedEditorDialog);
	UInt32																	GetTrackedIndex(HWND TrackedEditorDialog);
	HWND																	GetTrackedDialog(UInt32 TrackedEditorIndex);
	UInt32																	GetTrackedEditorCount() { return AllocationMap.size(); }
	UInt32																	GetLastContactedEditor() { return LastContactedEditor; }
	void																	SetLastContactedEditor(UInt32 TrackedEditorIndex) { LastContactedEditor = TrackedEditorIndex; }
};

#define EDAL																EditorAllocator::GetSingleton()

class CSEINIManager : public SME::INI::INIManager
{
public:
	void									Initialize();
};


				
// 0C+?
class TESDialogInitParam
{
public:
	UInt8		TypeID;					// 00
	UInt8		Pad01[3];				
	TESForm*	Form;					// 04
	UInt32		unk08;					// 08

	TESDialogInitParam(const char* EditorID);
	TESDialogInitParam(UInt32 FormID);
};

// 08
class TESCellUseData
{
public:
	TESCellUseData();
	~TESCellUseData();

	TESObjectCELL*		Cell;		// 00
	UInt32				Count;		// 04	
};

class TESCellUseList;

// 08		### partial
class INISetting
{
public:
	INISetting();
	~INISetting();

	union							// 00
	{
		int			iData;
		UInt32		uData;
		float		fData;
		char*		sData;
	};

	const char*		Name;			// 04
};

// 24
class TESFormIDListView
{
public:
	TESFormIDListView();
	~TESFormIDListView();

	// bases
	TESForm					Form;

	// no members
};

// 2C		### partial - look into the common settings class
class GameSetting
{
public:
	GameSetting();
	~GameSetting();

	// bases
	TESFormIDListView		listView;

	//members
	union								// 24
	{
		int					iData;
		float				fData;
		const char*			sData;
	};

	const char*				settingID;	// 28
};

class GameSettingCollection;

template<typename Type> struct GenericNode
{
	Type				* data;
	GenericNode<Type>	* next;
};

// 18 
struct TESRenderSelection
{
	struct SelectedObjectsEntry
	{
		TESForm*				Data;
		SelectedObjectsEntry*	Prev;
		SelectedObjectsEntry*	Next;
	};

	SelectedObjectsEntry*	RenderSelection;	// 00
	UInt32					SelectionCount;		// 04
	float					x, y, z;			// 08 sum of position vectors of selected refr's
	float					unk14;				// 14 init to 0.0
};

// 20
class Subwindow
{
public:
	Subwindow();
	~Subwindow();

	GenericNode<HWND>     controls;		// 00
    HWND                  hDialog;		// 08	handle of parent dialog window
    HINSTANCE             hInstance;	// 0C	module instance of dialog template
	POINT                 position;		// 10	position of subwindow within parent dialog
	HWND                  hContainer;	// 18	handle of container control (e.g. Tab Control)
    HWND                  hSubwindow;	// 1C	handle of subwindow, if created
};

// A0
class TESTopicInfo : public TESForm
{
public:
	TESTopicInfo();
	~TESTopicInfo();

	struct TopicListEntry
	{
		TESTopic*			data;
		TopicListEntry*		next;
	};

	struct LinkedTopics
	{
		TopicListEntry		topicsLinkedFrom;
		TopicListEntry		topicsLinkedTo;		// doubles as choices for appropriate infotype
	};

	struct ResponseEntry
	{
		// 24
		struct Data 
		{
			enum 
			{
				kEmotionType_Neutral = 0,
				kEmotionType_Anger,
				kEmotionType_Disgust,
				kEmotionType_Fear,
				kEmotionType_Sad,
				kEmotionType_Happy,
				kEmotionType_Surprise,
			};

			UInt32			emotionType;				// 00
			UInt32			emotionValue;				// 04
			UInt32			unk08;						// 08
			UInt32			unk0C;						// 0C
			String			responseText;				// 10
			String			actorNotes;					// 18	
			UInt32			unk20;						// 20
		};

		Data*				data;
		ResponseEntry*		next;		
	};

	 enum
	 {
		kInfoType_Topic = 0,
		kInfoType_Conversation,
		kInfoType_Combat,
		kInfoType_Persuasion,
		kInfoType_Detection,
		kInfoType_Service,
		kInfoType_Miscellaneous
	 };

	 enum
	 {
		kFlags_Goodbye = 0x0001,
		kFlags_Random = 0x0002,
		kFlags_SayOnce = 0x0004,
		kFlags_Unk008 = 0x0008,
		kFlags_InfoRefusal = 0x0010,
		kFlags_RandomEnd = 0x0020,
		kFlags_RunforRumors = 0x0040
	 };

	TESTopic*			unk024;			// 24 - always NULL ?
	ConditionEntry		conditions;		// 28
	UInt16				unk30;			// 30 - init to -1. used to determine previous info	?
	UInt16				infotype;		// 32 
	UInt8				flags;			// 34
	UInt8				flagsPad[3];	// 35
	TopicListEntry		addedTopics;	// 38
	LinkedTopics*		linkedTopics;	// 40
	ResponseEntry		responses;		// 44
	Script				resultScript;	// 4C
};

typedef TESTopicInfo::ResponseEntry::Data DialogResponse;

// 2C
struct ResponseEditorData
{
	struct VoiceRecorderData
	{
		HWND			recorderDlg;			// 00	
	};

	const char*				editorTitle;		// 00
	UInt32					maxResponseLength;	// 04
	DialogResponse*			selectedResponse;	// 08
	DialogResponse*			responseLocalCopy;	// 0C	
	VoiceRecorderData*		recorderData;		// 10
	TESTopic*				parentTopic;		// 14
	TESTopicInfo*			infoLocalCopy;		// 18
	TESTopicInfo*			selectedInfo;		// 1C
	TESQuest*				selectedQuest;		// 20
	GenericNode<TESRace*>	voicedRaces;		// 24
};

// 280		### partial
class Archive
{
public:
	Archive();
	~Archive();

	// 22+? (nothing beyond 0x22 initialized)
	struct Unk154
	{
		UInt32					unk00;			// initialized to 'BSA'
		UInt32					unk04;			// initialized to 0x67
		UInt32					unk08;			// initalized to 0x24
		UInt32					unk0C;
		UInt32					unk10;
		UInt32					unk14;
		UInt32					unk18;
		UInt32					unk1C;
		UInt16					unk20;			// flags of some sort
	};

	// bases
	BSFile						bsfile;			// 000

	//members
	Unk154						unk154;			// 154
	UInt32						unk176;			// 176
	UInt32						unk194;			// 194	bitfield
	LPCRITICAL_SECTION			archiveCS;		// 200
};

// ### partial
union GMSTData
{
	int				i;
	UInt32			u;
	float			f;
	const char*		s;	
};
struct GMSTMap_Key_Comparer
{
	bool operator()(const char* Key1, const char* Key2) const {
		return _stricmp(Key1, Key2) < 0;
	}
};

typedef std::map<const char*, GMSTData*, GMSTMap_Key_Comparer>		_DefaultGMSTMap;
extern _DefaultGMSTMap			g_DefaultGMSTMap;

class BSTextureManager;
class BSRenderedTexture;
class NiDX9Renderer;
typedef ModEntry::Data			TESFile;

enum 
{
	kTESObjectREFRSpecialFlags_3DInvisible				= 1 << 31,			// bits (only?) used in the runtime to mark modifications
	kTESObjectREFRSpecialFlags_Children3DInvisible		= 1 << 30,
};

enum
{
	kRenderWindowState_SnapToGrid					= 0x1,
	kRenderWindowState_SnapToAngle					= 0x2,
	kRenderWindowState_AllowRenderWindowCellLoads	= 0x4,
	kRenderWindowState_SkipInitialCellLoad			= 0x10,
	kRenderWindowState_UseCSDiscAsSource			= 0x20,		// deprecated
	kRenderWindowState_UseWorld						= 0x40,
};
